app/Controllers/Admin/Pengaturan.php

    public function get_config()
    {
        if (session('akses') == '1') {
            $db = db_connect();
            $data = $db->table('tbl_config')->get()->getRowArray();
---
SELECT *
FROM `tbl_config`