app/Controllers/Admin/Rekap.php

    public function get_count_peg($id, $month, $year)
    {


        $db = db_connect();

        $userSkpd = $db->table('users')->where('id_unit', $id)->countAllResults();
        $userTpp = $db->table('users')
            ->join('tpp', 'users.id = tpp.id_user', 'inner')
            ->where('id_unit', $id)
            ->where('month', $month)
            ->where('year', $year)

            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `id_unit` = '6'
SELECT COUNT(*) AS `numrows`
FROM `users`
INNER JOIN `tpp` ON `users`.`id` = `tpp`.`id_user`
WHERE `id_unit` = '6'
AND `month` = '4'
AND `year` = '2024'

    public function get_absen_user($id, $month, $year)
    {

        $db = db_connect();
        $model = new AbsenModel();
        $user = $db->table('users')->where('users.id', $id)->get()->getRow();
        $unit = $db->table('tbl_unit')->where('id', $user->id_unit)->get()->getRow();
        // Mendapatkan jumlah hari dalam bulan
        $daysInMonth = cal_days_in_month(CAL_GREGORIAN, $month, $year);

        // Array untuk menyimpan hasil
        $data = [];
        // Mendapatkan tanggal-tanggal yang ingin dilewati dari database
        $resultDateToSkip = $db->table('date_to_skip')
            ->select('date_to_skip')
            ->where('MONTH(date_to_skip)', $month)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_unit`
WHERE `id` = '26'
SELECT *
FROM `users`
WHERE `users`.`id` = '940'
SELECT `date_to_skip`
FROM `date_to_skip`
WHERE MONTH(date_to_skip) = '4'

    public function view_absen_tpp($id, $month, $year)
    {

        $db = db_connect();
        helper(['time']);
        helper('tanggal_indo_helper');
        $user = new UserModel();
        // Panggil fungsi untuk mendapatkan data absen
        $data = $this->get_absen_user($id, $month, $year);
        $user = $db->table('users')->where('users.id', $id)->get()->getRow();
        $upacara = $db->table('tbl_subtraction')->where('id_user', $id)->where('year', $year)->where('month', $month)->get()->getRow();
        $unit = $db->table('tbl_unit')->where('id', $user->id_unit)->get()->getRow();
        $tpp = $db->table('tpp')->where('id_user', $id)->where('month', $month)->where('year', $year)->get()->getFirstRow();
---
SELECT *
FROM `tbl_unit`
WHERE `id` = '26'
SELECT *
FROM `users`
WHERE `users`.`id` = '940'
SELECT *
FROM `tpp`
WHERE `id_user` = '940'
AND `month` = '4'
AND `year` = '2024'
SELECT *
FROM `tbl_subtraction`
WHERE `id_user` = '940'
AND `year` = '2024'
AND `month` = '4'