app/Controllers/Auth.php

SELECT *
FROM `tbl_admin`
LEFT JOIN `tbl_akses` ON `tbl_admin`.`id_akses` = `tbl_akses`.`id_akses`
WHERE `username` IS NULL
 LIMIT 1
---
    public function login()
    {
        $userModel = new TblAdmin();
        $request = service('request');
        $ip = $request->getIPAddress();
        $user = $userModel->table('tbl_admin')
            ->where('username', $this->request->getVar('username'))
            ->join('tbl_akses', 'tbl_admin.id_akses = tbl_akses.id_akses', 'left')
            ->first();