app/Controllers/Qr_code_scan.php

SELECT *
FROM `tbl_unit`
WHERE `id` = '5'
 LIMIT 1
---
    public function index()
    {
        if (session('akses') == 3) {
            $modelUnit = new UnitModel();
            $unit = $modelUnit->where('id', session('ses_id_unit'))->first();