app/Models/CutiModel.php

    public function getCutiByMonth($month)
    {
        $db = \Config\Database::connect();
        $builder = $db->table($this->table);

        $builder->select('id, id_user, no_surat, id_ket, start_date, end_date, subtraction');
        $builder->where("((YEAR(start_date) = YEAR(end_date) AND MONTH(start_date) <= $month AND MONTH(end_date) >= $month)
                          OR (YEAR(start_date) <> YEAR(end_date) AND (MONTH(start_date) <= $month OR MONTH(end_date) >= $month)))");

        $query = $builder->get();
---
SELECT `id`, `id_user`, `no_surat`, `id_ket`, `start_date`, `end_date`, `subtraction`
FROM `tbl_cuti`
WHERE ((YEAR(start_date) = YEAR(end_date) AND MONTH(start_date) <= 4 AND MONTH(end_date) >= 4) 
                          OR (YEAR(start_date) <> YEAR(end_date) AND (MONTH(start_date) <= 4 OR MONTH(end_date) >= 4)))