app/Controllers/Skpd/Absensi.php

SELECT *
FROM `tbl_unit`
WHERE `id` = '26'
 LIMIT 1
SELECT *
FROM `users`
WHERE `id_unit` = '26'
ORDER BY `sort` ASC
---
    public function index()
    {
        $modelUnit = new UnitModel();
            $unit = $modelUnit->where('id', session('ses_id_unit'))->first();


            $userModel = new UserModel();
            $user = $userModel->where('id_unit', session('ses_id_unit'))->orderBy('sort', 'ASC')->findAll();

SELECT *
FROM `users`
WHERE `id` = '3142'
---
    public function get_subtraction($id)
    {
        $db = db_connect();
        $user = $db->table('users')->where('id', $id)->get()->getRow();

SELECT *
FROM `tpp`
WHERE `id_user` = '3142'
AND `month` = '4'
AND `year` = '2024'
---
    public function posted_tpp()
    {

        $db = db_connect();
        $id_tpp = $this->request->getVar('id_tpp');
        $tl1 = $this->request->getVar('tl1');
        $tl2 = $this->request->getVar('tl2');
        $tl3 = $this->request->getVar('tl3');
        $tl4 = $this->request->getVar('tl4');
        $psw1 = $this->request->getVar('psw1');
        $psw2 = $this->request->getVar('psw2');
        $psw3 = $this->request->getVar('psw3');
        $psw4 = $this->request->getVar('psw4');
        $thck1 = $this->request->getVar('thck1');
        $thck2 = $this->request->getVar('thck2');
        $thck3 = $this->request->getVar('thck3');
        $ijm = $this->request->getVar('ijm');
        $ijp = $this->request->getVar('ijp');
        $tk = $this->request->getVar('tk');
        $tu = $this->request->getVar('tu');
        $lhkpn = $this->request->getVar('lhkpn');
        $tptgr = $this->request->getVar('tptgr');
        $subtraction = $this->request->getVar('subtraction');
        $dk = $this->request->getVar('dk');
        $month_tpp = $this->request->getVar('month_tpp');
        $year_tpp = $this->request->getVar('year_tpp');

        $tpp = $db->table('tpp')->where('id_user', $id_tpp)->where('month', $month_tpp)->where('year', $year_tpp)->get()->getRow();

UPDATE `tpp` SET `id_user` = '3142', `tl1` = '0.5', `tl2` = '0', `tl3` = '0', `tl4` = '0', `psw1` = '0', `psw2` = '0', `psw3` = '0', `psw4` = '1.55', `thck1` = '0', `thck2` = '0', `thck3` = '0', `tk` = '0', `tu` = '0', `lhkpn` = '0', `tptgr` = '0', `dk` = '97.95', `subtraction` = '2.05', `month` = '4', `year` = '2024', `updated_at` = '2024-04-30 15:14:30', `updated_by` = 'Dede Almustaqim'
WHERE `id_user` = '3142'
AND `month` = '4'
AND `year` = '2024'
---
        ];

        if ($tpp) {
            $result = $db->table('tpp')->where('id_user', $id_tpp)->where('month', $month_tpp)->where('year', $year_tpp)->update($data);

SELECT `tpp`.`id`, `tpp`.`id_user`, `tpp`.`tl1`, `tpp`.`tl2`, `tpp`.`tl3`, `tpp`.`tl4`, `tpp`.`psw1`, `tpp`.`psw2`, `tpp`.`psw3`, `tpp`.`psw4`, `tpp`.`thck1`, `tpp`.`thck2`, `tpp`.`thck3`, `tpp`.`tk`, `tpp`.`tu`, `tpp`.`lhkpn`, `tpp`.`tptgr`, `tpp`.`dk`, `tpp`.`subtraction`, `tpp`.`month`, `tpp`.`year`, `tpp`.`updated_at`, `tpp`.`updated_by`, `users`.`name`, `users`.`nip`
FROM `tpp`
LEFT JOIN `users` ON `tpp`.`id_user` = `users`.`id`
WHERE `tpp`.`id` = '190'
---
    public function get_tpp_by_id($id){
        $db = db_connect();
        $data = $db->table('tpp')
        ->select('tpp.id,
        tpp.id_user,
        tpp.tl1,
        tpp.tl2,
        tpp.tl3,
        tpp.tl4,
        tpp.psw1,
        tpp.psw2,
        tpp.psw3,
        tpp.psw4,
        tpp.thck1,
        tpp.thck2,
        tpp.thck3,
        tpp.tk,
        tpp.tu,
        tpp.lhkpn,
        tpp.tptgr,
        tpp.dk,
        tpp.subtraction,
        tpp.`month`,
        tpp.`year`,
        tpp.updated_at,
        tpp.updated_by,
        users.`name`,
        users.nip')
        ->join('users', 'tpp.id_user = users.id', 'left')
        ->where('tpp.id',$id)
        ->get()->getFirstRow();