app/Controllers/Skpd/Pegawai.php

    public function index()
    {
        if (session('akses') == 2) {
            $modelUnit = new UnitModel();
            $unit = $modelUnit->where('id', session('ses_id_unit'))->first();
---
SELECT *
FROM `tbl_unit`
WHERE `id` = '13'
 LIMIT 1