app/Controllers/Skpd/Rekap.php

    public function rekap_pegawai()
    {
        $modelUnit = new UnitModel();
            $unit = $modelUnit->where('id', session('ses_id_unit'))->first();
---
SELECT *
FROM `tbl_unit`
WHERE `id` = '13'
 LIMIT 1

    public function get_absen_user($id, $month, $year)
    {

        $db = db_connect();
        $model = new AbsenModel();
        $user = $db->table('users')->where('users.id', $id)->get()->getRow();
        $unit = $db->table('tbl_unit')->where('id', $user->id_unit)->get()->getRow();
        // Mendapatkan jumlah hari dalam bulan
        $daysInMonth = cal_days_in_month(CAL_GREGORIAN, $month, $year);

        // Array untuk menyimpan hasil
        $data = [];
        // Mendapatkan tanggal-tanggal yang ingin dilewati dari database
        $resultDateToSkip = $db->table('date_to_skip')
            ->select('date_to_skip')
            ->where('MONTH(date_to_skip)', $month)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_unit`
WHERE `id` = '26'
SELECT *
FROM `users`
WHERE `users`.`id` = '3142'
SELECT `date_to_skip`
FROM `date_to_skip`
WHERE MONTH(date_to_skip) = '4'

    public function view_absen($id, $month, $year)
    {

        helper(['time']);
        helper('tanggal_indo_helper');
        $user = new UserModel();
        // Panggil fungsi untuk mendapatkan data absen
        $data = $this->get_absen_user($id, $month, $year);
        $name = $user->where('id', $id)->first();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '475'

    public function view_absen_tpp($id, $month, $year)
    {

        $db = db_connect();
        helper(['time']);
        helper('tanggal_indo_helper');
        $user = new UserModel();
        // Panggil fungsi untuk mendapatkan data absen
        $data = $this->get_absen_user($id, $month, $year);
        $user = $db->table('users')->where('users.id', $id)->get()->getRow();
        $upacara = $db->table('tbl_subtraction')->where('id_user', $id)->where('year', $year)->where('month', $month)->get()->getRow();
        $unit = $db->table('tbl_unit')->where('id', $user->id_unit)->get()->getRow();
        $tpp = $db->table('tpp')->where('id_user', $id)->where('month', $month)->where('year', $year)->get()->getFirstRow();
---
SELECT *
FROM `tbl_unit`
WHERE `id` = '26'
SELECT *
FROM `users`
WHERE `users`.`id` = '3142'
SELECT *
FROM `tpp`
WHERE `id_user` = '3142'
AND `month` = '4'
AND `year` = '2024'
SELECT *
FROM `tbl_subtraction`
WHERE `id_user` = '3142'
AND `year` = '2024'
AND `month` = '4'

    public function view_absen_tpp_pdf($id, $month, $year)
    {
        $db = db_connect();
        helper(['time']);
        helper('tanggal_indo_helper');

        // Panggil fungsi untuk mendapatkan data absen
        $data = $this->get_absen_user($id, $month, $year);
        $user = $db->table('users')->where('users.id', $id)->get()->getRow();
        $upacara = $db->table('tbl_subtraction')->where('id_user', $id)->where('year', $year)->where('month', $month)->get()->getRow();
        $unit = $db->table('tbl_unit')->where('id', $user->id_unit)->get()->getRow();
---
SELECT *
FROM `tbl_unit`
WHERE `id` = '26'
SELECT *
FROM `tbl_subtraction`
WHERE `id_user` = '948'
AND `year` = '2024'
AND `month` = '4'
SELECT *
FROM `users`
WHERE `users`.`id` = '948'

    public function view_rekap_tpp_asn_pdf($month, $year)
    {
        $db = db_connect();
        helper(['time']);
        helper('tanggal_indo_helper');

        // Panggil fungsi untuk mendapatkan data absen
        $data = $db->table('tpp')->select('tpp.id,
	tpp.id_user,
	tpp.tl1,
	tpp.tl2,
	tpp.tl3,
	tpp.tl4,
	tpp.psw1,
	tpp.psw2,
	tpp.psw3,
	tpp.psw4,
	tpp.thck1,
	tpp.thck2,
	tpp.thck3,
	tpp.tk,
	tpp.tu,
	tpp.lhkpn,
	tpp.tptgr,
	tpp.dk,
	tpp.subtraction,
	tpp.`month`,
	tpp.`year`,
	tpp.updated_at,
	users.`name`,
	users.nip')
            ->join('users', 'tpp.id_user = users.id', 'left')
            ->where('tpp.month', $month)
            ->where('tpp.year', $year)
            ->where('users.id_unit', session('ses_id_unit'))
            ->where('users.status_peg', 'ASN')
            ->orderBy('users.sort', 'ASC')
            ->get()
            ->getResult();
        $unit = $db->table('tbl_unit')->where('id', session('ses_id_unit'))->get()->getRow();
---
SELECT `tpp`.`id`, `tpp`.`id_user`, `tpp`.`tl1`, `tpp`.`tl2`, `tpp`.`tl3`, `tpp`.`tl4`, `tpp`.`psw1`, `tpp`.`psw2`, `tpp`.`psw3`, `tpp`.`psw4`, `tpp`.`thck1`, `tpp`.`thck2`, `tpp`.`thck3`, `tpp`.`tk`, `tpp`.`tu`, `tpp`.`lhkpn`, `tpp`.`tptgr`, `tpp`.`dk`, `tpp`.`subtraction`, `tpp`.`month`, `tpp`.`year`, `tpp`.`updated_at`, `users`.`name`, `users`.`nip`
FROM `tpp`
LEFT JOIN `users` ON `tpp`.`id_user` = `users`.`id`
WHERE `tpp`.`month` = '3'
AND `tpp`.`year` = '2024'
AND `users`.`id_unit` = '13'
AND `users`.`status_peg` = 'ASN'
ORDER BY `users`.`sort` ASC
SELECT *
FROM `tbl_unit`
WHERE `id` = '13'