app/Controllers/Skpd/Rekap.php

    public function get_count_peg($id, $month, $year)
    {


        $db = db_connect();
        $id = session('ses_id_unit');
        $userSkpd = $db->table('users')->where('id_unit', $id)->countAllResults();
        $userTpp = $db->table('users')
        ->join('tpp', 'users.id = tpp.id_user', 'inner')
        ->where('id_unit', $id)
        ->where('month', $month)
        ->where('year', $year)

        ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `id_unit` = '26'
SELECT COUNT(*) AS `numrows`
FROM `users`
INNER JOIN `tpp` ON `users`.`id` = `tpp`.`id_user`
WHERE `id_unit` = '26'
AND `month` = '4'
AND `year` = '2024'