app/Controllers/Skpd/Rekap.php

    public function get_absen_user($id, $month, $year)
    {
        $db = db_connect();
        $model = new AbsenModel();
        $user = $db->table('users')->where('users.id', $id)->get()->getRow();
        $unit = $db->table('tbl_unit')->where('id', $user->id_unit)->get()->getRow();
        // Mendapatkan jumlah hari dalam bulan
        $daysInMonth = cal_days_in_month(CAL_GREGORIAN, $month, $year);

        // Array untuk menyimpan hasil
        $data = [];
        // Mendapatkan tanggal-tanggal yang ingin dilewati dari database
        $resultDateToSkip = $db->table('date_to_skip')
            ->select('date_to_skip')
            ->where('MONTH(date_to_skip)', $month)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '475'
SELECT *
FROM `tbl_unit`
WHERE `id` = '13'
SELECT `date_to_skip`
FROM `date_to_skip`
WHERE MONTH(date_to_skip) = '2'

    public function view_absen($id, $month, $year)
    {
        helper(['time']);
        helper('tanggal_indo_helper');
        $user = new UserModel();
        // Panggil fungsi untuk mendapatkan data absen
        $data = $this->get_absen_user($id, $month, $year);
        $name = $user->where('id', $id)->first();
---
SELECT *
FROM `users`
WHERE `id` = '475'
 LIMIT 1

    public function view_absen_tpp($id, $month, $year)
    {
        $db = db_connect();
        helper(['time']);
        helper('tanggal_indo_helper');
        $user = new UserModel();
        // Panggil fungsi untuk mendapatkan data absen
        $data = $this->get_absen_user($id, $month, $year);
        $data = $this->get_absen_user($id, $month, $year);
        $user = $db->table('users')->where('users.id', $id)->get()->getRow();
        $unit = $db->table('tbl_unit')->where('id', $user->id_unit)->get()->getRow();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '475'
SELECT *
FROM `tbl_unit`
WHERE `id` = '13'